---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.UnsupportedFamilySymbol
enum: Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult
source: html/7f028cdc-ad5f-a349-b3e7-8c7d2e65ded0.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.UnsupportedFamilySymbol

Failed due to attempting to convert an unsupported Family symbol. It is expected to be either valve, strainer, damper, smoke detector, end cap, or other in line component.